<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [60]:
import pandas as pd
import psycopg2

In [61]:
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [62]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [63]:
# текст запроса
query_3_1 = f'''select *
            from vacancies 
         '''
vacancies = pd.read_sql_query(query_3_1, connection)

vacancies.shape[0]

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\4244298446.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  vacancies = pd.read_sql_query(query_3_1, connection)

49197

In [64]:
# результат запроса
49197

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [65]:
# текст запроса
query_3_1 = f'''select *
            from employers 
         '''
employers = pd.read_sql_query(query_3_1, connection)

employers.shape[0]

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2695126918.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employers = pd.read_sql_query(query_3_1, connection)

23501

In [66]:
# результат запроса
23501

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [67]:
# текст запроса
query_3_1 = f'''select *
            from areas 
         '''
areas = pd.read_sql_query(query_3_1, connection)

areas.shape[0]

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\3965113091.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  areas = pd.read_sql_query(query_3_1, connection)

1362

In [68]:
# результат запроса
1362

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [69]:
# текст запроса
query_3_1 = f'''select *
            from industries 
         '''
industries = pd.read_sql_query(query_3_1, connection)

industries.shape[0]

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\3698223922.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  industries = pd.read_sql_query(query_3_1, connection)

294

In [70]:
# результат запроса
294

294

***

In [71]:
# выводы по предварительному анализу данных

В базе большое количество регионов и сфер деятельности. То же можно сказать о вакансиях и работадателях. Исходя из этих показателей, можно сказать о широком покрытии HH.ru. 
Такой же вывод можно сделать из пропорции работадателей / вакансий и того, что у крупных работадателей больше вакансий. Значит и мелкие работадатели имеют хоть 1-2 вакансии.
Это тоже говорит о широком охвате HH.ru

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [72]:
# текст запроса

query_4_1 = f'''select 
                  a.name area,
                  count(v.id) cnt
                from areas a
                join vacancies v on a.id = v.area_id
                group by a.name, v.area_id 
                order by cnt desc
                limit 5
         '''
df = pd.read_sql_query(query_4_1, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\718890369.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [73]:
# результат запроса

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [74]:
# текст запроса

query_4_2 = f'''select 
                    count(v.id) cnt
                from vacancies v
                where v.salary_from is not null or v.salary_to is not null 
            
         '''
df = pd.read_sql_query(query_4_2, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\411043725.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

In [75]:
# результат запроса

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [76]:
# текст запроса

query_4_3 = f'''select 
                    round(avg(v.salary_from)) up,
                    round(avg(v.salary_to)) down
                from vacancies v
                        
         '''
df = pd.read_sql_query(query_4_3, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\283716699.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

        up      down
0  71065.0  110537.0

In [77]:
# результат запроса

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [78]:
# текст запроса
query_4_4 = f'''select 
                    schedule,
                    employment,
                    count(id)
                from vacancies 
                group by schedule, employment
                order by count(id) desc  
                               
         '''
df = pd.read_sql_query(query_4_4, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2824070767.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

In [79]:
# результат запроса

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [80]:
# текст запроса
query_4_5 = f'''select 
                    experience,
                    count(id)
                from vacancies 
                group by experience
                order by count(id)  
                                    
         '''
df = pd.read_sql_query(query_4_5, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\838124995.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [81]:
# результат запроса

***

In [82]:
# выводы по детальному анализу вакансий

Ожидаемо лидер по количеству вакансий - Москва, далее Санкт-Петербург. Также в пятерку вошли крупные столицы республик, где подавляющее, либо большое количество русскоговорящего населения. Также логично место в пятерке Новосибирска - третьго по численности города России, крупнейшего азиатского центра страны.
Примерно у половины вакансий заполнено хотя бы одно поле желаемой з/п. Это маленький показатель и говорит о неуверенности соискателей. С учетом того, что вилка желаемой з/п достаточно высока и она скорее принадлежит квалифицированным соискателям, можно предположить, что не ставят желаемую з/п - низкоквалифицированные, неуверенные соскатели либо без опыта работы.
Подавляющее большинство желают полный рабочий день с полной занятостью и, соответственно, максимально возможной з/п. Показательна 2 строчка с удаленной работой, но полной занятостью. Этот тренд набирает всё большую популярность. 
Интересна статистика по опыту работы. Первое место с отрывом: от 1 до 3 лет. Это люди уже с опытом и знаниями, но не претендющие, как правило, на повышенную зарплату. Это выгодно работадателю. Также сказывается человеческий фактор. Работадатель не "заморачивается" - 3-6 лет, от 6 лет... Указывает понятную и устраивающую его опцию, которая не отсекает подходящих претендентов.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [83]:
# текст запроса
query_5_1 = f'''select 
                    e.name,
                    count(v.id)
                from employers e
                join vacancies v on e.id = v.employer_id
                group by e.name
                order by count(v.id)  desc
                limit 5
                                    
         '''
df = pd.read_sql_query(query_5_1, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2533546221.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [84]:
# результат запроса

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [85]:
# текст запроса
query_5_2 = f'''(select 
                    a.name,
                    count(distinct e.id) cnt_emp,
                    count(distinct v.id) cnt_vac
                from areas a
                join employers e on a.id = e.area
                join vacancies v on a.id = v.area_id    
                group by a.id    
                order by 1) 
            
            union    
            
                (select 
                    a.name,
                    count(distinct e.id) cnt_emp,
                    count(distinct v.id) cnt_vac
                from areas a
                join employers e on a.id = e.area
                left join vacancies v on a.id = v.area_id   
                where v.id is null 
                group by a.id    
                order by 2 desc
                limit 1)   
                
                order by 3 desc                          
         '''
df = pd.read_sql_query(query_5_2, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\106357473.py:27: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                                               name  cnt_emp  cnt_vac
0                                            Москва     5864     5333
1                                   Санкт-Петербург     2217     2851
2                                             Минск     1115     2112
3                                       Новосибирск      573     2006
4                                            Алматы      721     1892
..                                              ...      ...      ...
464  Михнево (Московская область, Ступинский район)        1        1
465                Приморск (Ленинградская область)        1        1
466                                           Пласт        1        1
467                                  Красная Поляна        1        1
468                                          Россия      410        0

[469 rows x 3 columns]

In [86]:
# результат запроса

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [87]:
# текст запроса
query_5_3 = f'''select 
                    e.name,
                    count(distinct v.area_id) cnt_exp
                from employers e
                join vacancies v on e.id = v.employer_id
                group by e.name  
                order by 2 desc                    
         '''
df = pd.read_sql_query(query_5_3, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\4238633316.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                         name  cnt_exp
0                      Яндекс      181
1                  Ростелеком      152
2                  Спецремонт      116
3      Поляков Денис Иванович       88
4                   ООО ЕФИН        71
...                       ...      ...
14761                  UniSol        1
14762            UNISTORY LLC        1
14763                   UNIT6        1
14764     United Distribution        1
14765              UNITEL LLC        1

[14766 rows x 2 columns]

In [88]:
# результат запроса

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [89]:
# текст запроса
query_5_4 = f'''select 
                    count(e.id) cnt_null
                from employers e     
                left join employers_industries ei on e.id = ei.employer_id
                where ei.industry_id is null
                                       
         '''
df = pd.read_sql_query(query_5_4, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2066103608.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   cnt_null
0      8419

In [90]:
# результат запроса

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [91]:
# текст запроса
query_5_5 = f'''select 
                    e.name
                from employers e     
                left join employers_industries ei on e.id = ei.employer_id
                group by e.id
                having count(e.id) = 4
                order by 1
                offset 2
                limit 1
                                       
         '''
df = pd.read_sql_query(query_5_5, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\1018473703.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

   name
0  2ГИС

In [92]:
# результат запроса

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [93]:
# текст запроса
query_5_6 = f'''select 
                    count(ei.employer_id) cnt_prog
                from employers_industries ei      
                join industries i on ei.industry_id = i.id
                where i.name = 'Разработка программного обеспечения'
                                       
         '''
df = pd.read_sql_query(query_5_6, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\140434464.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   cnt_prog
0      3553

In [94]:
# результат запроса

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [95]:
# код для получения списка городов-милионников

In [96]:
# текст запроса
query_5_7 = f'''(select 
                    a.name,
                    count(v.id) cnt
                from vacancies v    
                join employers e on v.employer_id = e.id
                join areas a  on v.area_id = a.id
                where a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань','Нижний Новгород','Челябинск',
                  'Красноярск','Самара', 'Уфа', 'Ростов-на-Дону', 'Омск','Краснодар','Воронеж','Пермь','Волгоград')
                  and e.name = 'Яндекс'
                group by a.name)
            
                union
            
                (select 
                    'Total',
                    count(v.id) 
                from vacancies v    
                join employers e on v.employer_id = e.id
                join areas a  on v.area_id = a.id
                where a.name in ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань','Нижний Новгород','Челябинск',
                  'Красноярск','Самара', 'Уфа', 'Ростов-на-Дону', 'Омск','Краснодар','Воронеж','Пермь','Волгоград')
                  and e.name = 'Яндекс'
                )
                order by 2
                                       
         '''
df = pd.read_sql_query(query_5_7, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\4268173937.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

In [97]:
# результат запроса

***

In [98]:
# выводы по анализу работодателей

С большим отрывом по количеству вакансий - Яндекс. Это крупная, активно развивающаяся в разных сферах (от такси до банкинга) компания. Показательно, что первые четыре места занимают компаниии, которые развивают "цифровые" услуги. За "цифрой" будущее. И оно уже наступило). Это подтверждает и первые две строчки Яндекса и Ростелеком по количеству регионов, где они присутствуют.
Москва - лидер по количеству и вакансий, и работадателей. Примечательно, что в Москве работодателей больше, чем вакансий. Во-первых, в Москве вакансии закрываются более активно. Во-вторых, у работадателей постоянно появляются вакансии и они держат свою учетную запись на HH.ru, даже если сейчас нет набора сотрудников. Понятно, что Россия самый большой регион и наибольшее количество работадателей без вакансий.
Больше четверти работадателей не указывают сферу деятельности. И это ошибка. Могут отсеиваться наиболее грамотные соискатели, которые ищут по сфере деятельности. 
У большого числа работадателей открыты вакансии, где в качестве сферы деятельности указана "Разработка программного обеспечения". И это только одна из специализаций, относящейся к Данным. Значит, программисты востребованны. 
У Яндекса, естественно, больше вакансий в Москве, потом Питер и т.д. На города миллионники приходится примерно четверть вакансий. Остальные "разбросанны" по другим регионам, ведь Яндекс представлен очень широко.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [99]:
# текст запроса
query_6_1 = f'''select 
                  COUNT(id) AS cnt
                from vacancies     
                where name ilike '%data%' 
                   or name ilike '%данн%' 
                  
                                       
         '''
df = pd.read_sql_query(query_6_1, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\4072204087.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

    cnt
0  1771

In [100]:
# результат запроса

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [114]:
# текст запроса
query_6_2 = f'''select 
                    COUNT(id) AS cnt
                FROM vacancies 
                WHERE (name ilike '%data scientist%' OR
                    name ilike '%data science%'  OR
                    name ilike '%исследователь данных%' OR
                    (name like '%ML%' AND name NOT like '%HTML%') OR
                    name ilike '%machine learning%' OR
                    name ilike '%машинн%обучен%') AND
                    (name ilike '%junior%' OR
                    experience = 'Нет опыта' OR
                    employment = 'Стажировка')
                                       
         '''
df = pd.read_sql_query(query_6_2, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2799501354.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   cnt
0   51

In [102]:
# результат запроса

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [103]:
# текст запроса
query_6_3 = f'''select 
                    COUNT(id) AS cnt
                FROM vacancies 
                WHERE (name ilike '%data scientist%' 
                    or name ilike '%data science%'  
                    or name ilike '%исследователь данных%' 
                    or (name like '%ML%' AND name NOT ilike '%HTML%') 
                    or name ilike '%machine learning%' 
                    or name ilike '%машинн%обучен%') 
                    and (key_skills ilike '%postgres%' or key_skills like '%SQL%')
                                         
         '''
df = pd.read_sql_query(query_6_3, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\523699241.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   cnt
0  201

In [104]:
# результат запроса

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [105]:
# текст запроса
query_6_4 = f'''select 
                    COUNT(id) AS cnt
                FROM vacancies 
                WHERE (name ilike '%data scientist%' 
                    or name ilike '%data science%'  
                    or name ilike '%исследователь данных%' 
                    or (name like '%ML%' AND name NOT ilike '%HTML%') 
                    or name ilike '%machine learning%' 
                    or name ilike '%машинн%обучен%') 
                    and key_skills ilike '%Python%' 
                                         
         '''
df = pd.read_sql_query(query_6_4, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2175059164.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   cnt
0  351

In [106]:
# результат запроса

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [107]:
# текст запроса
query_6_5 = f'''select 
                    round(avg((LENGTH(key_skills) + 1 - LENGTH(replace(key_skills, chr(9),'')))),2)  AS cnt
                FROM vacancies 
                WHERE (name ilike '%data scientist%' 
                    or name ilike '%data science%'  
                    or name ilike '%исследователь данных%' 
                    or (name like '%ML%' AND name NOT ilike '%HTML%') 
                    or name ilike '%machine learning%' 
                    or name ilike '%машинн%обучен%')
                    and key_skills is not null   
                                                             
         '''
df = pd.read_sql_query(query_6_5, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\443124786.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

    cnt
0  6.41

In [108]:
# результат запроса

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [109]:
# текст запроса
query_6_6 = f'''select 
                    experience,
                    round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0) zp
                FROM vacancies 
                WHERE (name ilike '%data scientist%' 
                    or name ilike '%data science%'  
                    or name ilike '%исследователь данных%' 
                    or (name like '%ML%' AND name NOT ilike '%HTML%') 
                    or name ilike '%machine learning%' 
                    or name ilike '%машинн%обучен%')
                    and (salary_from is not null or salary_to is not null)
                group by experience    
                    
                                         
         '''
df = pd.read_sql_query(query_6_6, connection)         
display(df)

C:\Users\Maxim\AppData\Local\Temp\ipykernel_11828\2001368219.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience        zp
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0

In [110]:
# результат запроса

***

In [111]:
# выводы по предметному анализу

В базе большое количество вакансий относится к "Данным". Начинающие data scientist без опыта не очень востребованны. Среди data scientist востребованна опция SQL и у подавляющей доли вакансий - Python. В среднем data scientist должен обладать 6-7 навыками.
Хотя у начинающего специалиста достаточно высокая з/п в вакансиях. С опытом от года з/п уже почти в 2 раза больше. От 3 лет - практически еще удваивание. Ценные кадры.

# Общий вывод по проекту

In [112]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

Ресурс  HH.ru востребован, в нем широко представлены регионы, работадатели, вакансии.
Количество работадателей и вакансий, конечно, зависит от количество жителей региона, населенного пункта. Везде лидер - Москва. 
Самый популярный график - полный рабочий день с полной занятостью и, соответственно, максимально возможной з/п. Всё большую популярность набирает график с удаленной работой, но полной занятостью.
Работадатели готовы брать людей с опытом от года. Навыки есть, з/п не максимальная.
Работадателям можно посоветовать указывать сферу деятельности. Так эффективней искать претендентов.
Наибольшее количество вакансий у "цифровых" компаний, в частности Яндекса. Этот тренд будет только усиливаться. Большое количество вакансий за программистами. Есть своя доля и у data scientist. Уровень з/п у них высокий и быстро растет с опытом.